Repository: aknay/health_tracker_app
Catalog: lib/l10n/app_*.arb
Languages: my

source: Hello World!
my: မင်္ဂလာပါ

source: Add blood pressure
my: သွေးပေါင်ချိန် ထည့်ရန်

source: Add weight
my: ခန္ဓာကိုယ်အလေးချိန် ထည့်ရန်

source: Add Blood Glucose
my: ဆီးချိုပမာဏ ထည့်ရန်

# shareWithFriends
source: Share Blood Glucose
my: သိသောသူများကိုမျှဝေပါ

source: More
my: နောက်ထပ်

source: Statistics
my: စာရင်းဇယား

source: Home
my: ပင်မစာမျက်နှာ

source: Change Language
my: ဘာသာစကား ပြောင်းရန်

source: CANCEL
my: ပယ်ဖျက်ရန်

source: OK
my: အိုကေ

# addBloodGlucoseData
source: Add data
my: ဆီးချိုပမာဏ ထည့်ရန်

# editBloodGlucoseData
source: Edit Blood Glucose
my: ဆီးချိုပမာဏ ပြင်ဆင်ရန်

source: Time
my: အချိန်

source: Blood Glucose
my: ဆီးချိုပမာဏ

source: Period
my: ကာလ

source: Just After Wake up
my: မနက် ထပြီးပြီးခြင်း

source: Before Breakfast
my: မနက်စာ မစားမီ

source: After Breakfast
my: မနက်စာ စားပြီးနောက်

source: Before Lunch
my: နေ့လည်စာ မစားမီ

source: After Lunch
my: နေ့လည်စာ စားပြီးနောက်

source: Before Dinner
my: ညစာ မစားမီ

source: After Dinner
my: ညစာ စားပြီးနောက်

source: Just Before Bed Time
my: ညအိပ်ယာ မဝင်မီ

source: Select
my: ကာလကို ရွေးချယ်ပါ

# otherRoutine
source: Other
my: အခြား

# errorEmptyRoutine
source: Please select a period first
my: ကာလကို ရွေးချယ်ပါ။

# errorEmptyBloodGlucose
source: Please fill in the blood glucose value first
my: ဆီးချိုပမာဏကို ဦးစွာဖြည့်ပါ။

# cardBloodGlucose
source: Blood Glucose
my: ဆီးချို

source: Are you sure you want to delete this record?
my: ဤစာရင်းကို ဖျက်လိုသည်မှာ သေချာပါသလား?

source: Successfully deleted.
my: ဖျက်လိုက်ပါပြီ။

# failToDelete
source: Fail to delete. Try again later.
my: ဖျက်၍မရ လိုက်ပါ။ နောက်မှ ထပ်ကြိုးစားပါ။

source: You don't have any entries yet.
my: ထည့်သွင်းမှုများ မရှိသေးပါ။

source: Units
my: ယူနစ်

# bloodGlucoseUnit
source: Blood Glucose
my: ဆီးချိုယူနစ်

# toChangeBloodGlucoseUnit
source: Change Blood Glucose Unit
my: ဆီးချိုယူနစ်ကို ပြောင်းလဲရန်

source: Past 7 Days
my: လွန်ခဲ့သော ၁ပတ်

source: All Periods
my: ကာလအားလုံး

source: Average
my: ပျမ်းမျှ

# oneMonth
source: Past One Month
my: လွန်ခဲ့သော ၁လ

source: Condition
my: အခြေအနေ

source: Excellent
my: အလွန်ကောင်းပါသည်

source: Good
my: ကောင်းပါသည်

source: Acceptable
my: လက်ခံနိုင်သည်

source: Poor
my: မကောင်းပါ

source: Unable to calculate
my: မတွက်နိုင်သေးပါ

source: Reading
my: ပမာဏ

source: Medication
my: ဆေးဝါး

source: Enter Value
my: ပမာဏကိုရေးပါ

source: Systolic
my: အပေါ်သွေး

source: Diastolic
my: အောက်သွေး

# bloodPressureNormal
source: Normal Blood Pressure
my: သွေးပေါင်ချိန် ပုံမှန်

# bloodPressureLow
source: Low Blood Pressure
my: သွေးအားနည်း

# bloodPressureElevated
source: Elevated Blood Pressure
my: သွေးပေါင်ချိန် နည်းနည်းမြင့်

# bloodPressureHighStageOne
source: High Blood Pressure
my: သွေးပေါင်ချိန် မြင့်

# bloodPressureHighStageTwo
source: Very High Blood Pressure
my: သွေးပေါင်ချိန် အလွန်မြင့်

# bloodPressureHypertensiveCrisis
source: Hypertensive Crisis
my: အလွန်အကျွံသွေးတိုး

# textBloodPressure
source: Blood Pressure
my: သွေးပေါင်ချိန်
